import { Component } from '@angular/core';
@Component({
    styleUrls: ['mainPage.component.css'],
    templateUrl: './mainPage.component.html'
})
export class mainPageComponent {

    primaryAboutTitle: string;
    primaryAboutText: string;
    testText: string;


    constructor() {

        this.primaryAboutTitle = 'החצר של ליאון';
        this.primaryAboutText = '.ברוכים הבאים לביתו של ליאון\n.מקום לאירועים פרטיים מיוחדים\nהבסיס לכל ארוחה הוא המעשנה, בכל ארוחה מעשנים מגוון בשרים איכותיים אשר\n.הושרו במרינדות עשירות וייחודיות המשביחות את טעמם הייחודי של נתחי הבשר\n.את טכניקת העישון רכש ליאון לפני מספר שנים ומאז הלך והתמקצע בתחום\n.אפיית הפוקצות ועישון הבשר נעשים במקום ומול עיני הסועדים\n.המאפים, הסלטים והמנות הראשונות כולם עשויים מחומרי גלם טריים ואיכותיים\n.אוירה כפרית וחמה, ריחות ארומה וניחוחות משכרים של עישון עדין משבבי עצי דובדבן, היקורי ורוזמרין מלווים את הארוחה\n.המנות מוגשות למרכז השולחן ללא הגבלה, יחד עם שתייה קלה, בירות ויין.\n.הבית פתוח בהזמנה מראש עד 20 איש\n .המתחם מצויד במערכות תאורה, סאונד ותצוגה המתאימות לכל סוג אירוע';
    }

}
