import { Component } from '@angular/core';

@Component({
   styleUrls: ['hosting.component.css'],
   templateUrl: './hosting.component.html'
})
export class hostingComponent {

   meatExDescp: string;
   fishExDescp: string;
   brunchExDescp: string;


   constructor() {
      this.meatExDescp = ':החוויה הבשרית\n,מבחר בשרים מעושנים ואיכותיים מוגשים ישירות מהמעשנה\n תפוחי אדמה אפויים בשמן זית שום ומרווה, סלטים יחודיים וטריים\n.פוקאצ' + "'" + 'ות אפיה במקום, יין, בירה, שתייה קלה, וקינוח';
      this.fishExDescp = ':חווית הדגים המעושנים' + '\n' + ',מבחר דגים טריים ומעושנים מוגשים ישירות מהמעשנה\n.סלטים יחודיים וטריים' + '\n' + '.תפוחי אדמה אפויים בשמן זית שום ומרווה, פוקאצ' + "'" + 'ות אפייה במקום, יין, בירה, שתיה קלה, וקינוח';
      this.brunchExDescp = ':חווית הברנאצ' + "' " + 'בימי שישי' + '\n' + ',מבחר גבינות רזות שמנות וקשות בליווי דגים מעושנים המגיעים היישר מהמעשנה, קיש בצל/קיש פטריות' + '\n' + ',פוקאצ' + "'" + 'ות אפויות במקום בליווי מטבלים, בנוסף לסלטים יחודיים וטריים' + '\n' + '.יין, שתייה קלה, וקינוח';
   }

}
